In [1]:
import pandas as pd
import numpy as np
import json, requests

In [2]:
### add hotels to NY ###
def location_to_criteria_count(x,y, criteria):
    combined = str(x)+","+str(y)
    url = 'https://api.foursquare.com/v2/venues/explore'

    params = dict(
              client_id='NFUOF1KOJLLVONWSYFOVSGCPMPONKXSNIJKUHTFCYEFQ3R5B',
              client_secret='T24DDPFSXWFYHCFIOC4N0SKV3AWYOULDWDEO4E0ZHRVSZPFJ',
              v='20180323',
              ll=combined,
            radius='1000',
              query=criteria,
              limit=1
            )
    resp = requests.get(url=url, params=params)
    data = json.loads(resp.text)
    if 'response' in data and 'totalResults' in data['response']:
        return data['response']['totalResults']
    return 0

In [4]:
NYlistings = pd.read_csv('./listings.csv', low_memory=False)
NYlistings = NYlistings[['id', 'latitude', 'longitude']]
NYlistings.head()

     id  latitude  longitude
0  3647  40.80902  -73.94190
1  3831  40.68514  -73.95976
2  5022  40.79851  -73.94399
3  5099  40.74767  -73.97500
4  5121  40.68688  -73.95596

In [7]:
NYlistings['hotel_count'] = NYlistings.apply(lambda x: location_to_criteria_count(x.latitude, x.longitude, 'hotels'), axis=1)  
NYlistings.head()

     id  latitude  longitude  hotel_count
0  3647  40.80902  -73.94190            7
1  3831  40.68514  -73.95976            5
2  5022  40.79851  -73.94399            8
3  5099  40.74767  -73.97500          127
4  5121  40.68688  -73.95596            6

In [9]:
# NYlistings.to_csv('./NYhotel_count.csv', index=False)

In [10]:
NYlistings.head()

     id  latitude  longitude  hotel_count
0  3647  40.80902  -73.94190            7
1  3831  40.68514  -73.95976            5
2  5022  40.79851  -73.94399            8
3  5099  40.74767  -73.97500          127
4  5121  40.68688  -73.95596            6